Revit 2026 API

# ReferenceGlobalPoint Property

---

The position on which the reference is hit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GlobalPoint { get; }
```
```vb
Public ReadOnly Property GlobalPoint As XYZ
	Get
```
```cpp
public:
property XYZ^ GlobalPoint {
	XYZ^ get ();
}
```
```fsharp
member GlobalPoint : XYZ with get
```

#### Return Value

XYZ if the reference doesn't have a global point.

When using a plan view, the Z-value of a GlobalPoint is not meaningful.

#### Reference

Reference Class

Autodesk.Revit.DB Namespace